Tekla.Structures.Analysis.AnalysisObjectEnumerator.type
The analysis enumerator type.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.modelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectId1
The identifier 1 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectType1
The type 1 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectId2
The identifier 2 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectType2
The type 2 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectId3
The identifier 3 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectId4
The identifier 4 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.objectId5
The identifier 5 of the object.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.analysisObjectIDs
The list of identifiers of enumerated objects.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.#ctor(Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.String)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObjectEnumerator class.
type: The type of the enumerator
typeToSelect: The type of the objects to be selected.
analysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.#ctor(Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.String,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32,System.Int32,System.Int32)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObjectEnumerator class.
type: The type of the enumerator
typeToSelect: The type of the objects to be selected.
analysisModelName: The name of the analysis model.
id1: The identifier of the object 1.
type1: The type of the object 1.
id2: The identifier of the object 2.
type2: The type of the object 2.
id3: The identifier of the object 3.
id4: The identifier of the object 4.
id5: The identifier of the object 5.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.SelectInstances
Gets or sets a value indicating whether the instance's Select() is called when the "Current" item is asked from the enumerator.
The user can set this to "false" if no members are ever asked from the instance. This is the case
when e.g. asking only a report property from this identifier. WARNING: normally the user should not change this value.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.EnumerateObjects
Gets the objects from DB.
The rules of the enumerator are to be corretly filled in before calling this method.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.RefreshEnumeration
Refreshes the identifiers from the analysis database.